In [1]:
# 1. Two sum
print('ASCII code Z =', ord('z'))
s = 'string'
sum = 0
for i in range(len(s)-1):
    sum +=(abs(ord(s[i])-ord(s[i+1])))

print('row = ', s)
print('sum codes = ', sum)

ASCII code Z = 122
row =  string
sum codes =  24

In [4]:
# 175. Combine Two Tables
import pandas as pd

data_person = {
  "personId": [1, 2, 3],
  "lastName": ['Ivanov', 'Li', 'Ki'],
  "firstName": ['Alex', 'Vano', 'All']
}

df_pers = pd.DataFrame(data_person)
df_pers

   personId lastName firstName
0         1   Ivanov      Alex
1         2       Li      Vano
2         3       Ki       All

In [5]:
data_adres = {
  "personId": [1, 2],
  "addressId": [42, 2],
  "city": ['Moscow', 'Blaburg']
}

df_adres = pd.DataFrame(data_adres)
df_adres

   personId  addressId     city
0         1         42   Moscow
1         2          2  Blaburg

In [7]:
df_pers.merge(df_adres,on='personId',how='left')

   personId lastName firstName  addressId     city
0         1   Ivanov      Alex       42.0   Moscow
1         2       Li      Vano        2.0  Blaburg
2         3       Ki       All        NaN      NaN

In [16]:
def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    mer = person.merge(address,on='personId',how='left')
    result mer

SyntaxError: invalid syntax (730943360.py, line 3)

In [17]:
combine_two_tables(df_pers,df_adres)

In [14]:
m